; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-2 - location
	p1-4 - location
	p3-0 - location
	p3-4 - location
	p4-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s3)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s2)
	(at package2 s0)
	(at package3 s1)
	(at package4 s3)
	(at package5 s4)
	(at package6 s4)
	(at package7 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 91)
	(= (time-to-drive s1 s0) 91)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 30)
	(= (time-to-drive s2 s0) 30)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 46)
	(= (time-to-drive s4 s0) 46)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 6)
	(= (time-to-drive s3 s1) 6)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 47)
	(= (time-to-drive s0 s3) 47)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 26)
	(= (time-to-drive s2 s3) 26)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 80)
	(= (time-to-drive s1 s4) 80)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 40)
	(= (time-to-drive s2 s4) 40)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at truck1 s2)
	(at truck3 s2)
	(at truck4 s0)
	(at truck5 s4)
	(at package2 s3)
	(at package3 s0)
	(at package4 s3)
	(at package5 s4)
	(at package6 s2)
	(at package7 s1)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 11
2. (drive-truck truck3 s3 s0 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 470
   goals met: 3 of 11
3. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 11
4. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (fuel-used) from 470 to 987
   goals met: 3 of 11
5. (unload-truck package2 truck3 s3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 11
6. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 4 of 11
7. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 4 of 11
8. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 4 of 11
9. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 987 to 1897
   goals met: 4 of 11
10. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 11
11. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 1897 to 2777
   goals met: 4 of 11
12. (load-truck package6 truck1 s4)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 11
13. (load-truck package7 truck1 s4)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 4 of 11
14. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 2777 to 3513
   goals met: 4 of 11
15. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 11
16. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 3513 to 3903
   goals met: 6 of 11
17. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 11
18. (drive-truck truck1 s2 s4 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 3903 to 4343
   goals met: 6 of 11
19. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 4343 to 5223
   goals met: 6 of 11
20. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 11
21. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 5223 to 6023
   goals met: 7 of 11
22. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 6023 to 6423
   goals met: 8 of 11
23. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 8 of 11
24. (board-truck driver1 truck4 s3)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 8 of 11
25. (drive-truck truck4 s3 s0 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 6423 to 6893
   goals met: 9 of 11
26. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 9 of 11
27. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   goals met: 9 of 11
28. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 9 of 11
29. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   goals met: 9 of 11
30. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   goals met: 9 of 11
31. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   goals met: 9 of 11
32. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   goals met: 9 of 11
33. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 9 of 11
34. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   goals met: 10 of 11
35. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 6893 to 7153
   goals met: 11 of 11
